[
    {
        "title": "Jell-O Chocolate Instant Pudding",
        "ingredients": "1 pack pudding mix, 2 cups cold milk",
        "method": "Beat pudding mix and milk with whisk 2 min. Pudding will be soft-set in 5 min. Makes 4 (1/2-cup) servings. Refrigerate any leftovers.",
        "like_count": 3,
        "user_id": 1
    },
    {
        "title": "Betty Crocker's Merry Christmas Cookies",
        "ingredients": "1/3 cup soft shortening, 1/3 cup brown sugar, 1 egg, 2/3 cup molasses, 2 and 3/4 cups sifted flour, 1 tsp [baking?] soda, 1 tsp salt, 2 tsp cinnamon, 1 tsp ginger",
        "method": "Temperature: 375 degrees F, Time: bake 8 to 10 minutes, Amount: about 5 dozen 2.5 inch cookies -- Mix together thoroughly the shortening, brown sugar, egg, and molasses. Sift together and stir in the flour, [baking] soda, salt,cinnamon, and ginger. Chill dough. Roll out 1/4 inch thick. Cut into desired shapes. Place 1 inch apart on lightly greased baking sheet. Bake until, when touched lightly with finger, no imprint remains. When cool, ice and decorate as desired.",
        "like_count": 7,
        "user_id": 2
    },
    {
        "title": "Banana Fritters",
        "ingredients": "1 ⅔ cup mashed overripe Bananas (about 5 medium bananas), 3 Tbsp Brown Sugar, ¼ tsp Nutmeg, ¼ tsp Cinnamon, ½ tsp Vanilla extract, pinch Salt, 1 cup all-purpose Flour, 1-2 Tbsp Cooking Oil, 1 Tbsp granulated Sugar",
        "method": "1. Mash bananas with sugar and spices; stir flour into banana mixture. 2. Heat 1 or 2 Tbsp cooking oil on High and, using a serving spoon, spoon batter into pan. 3. Fry fritters until crisp and brown on both sides; you may have to add more cooking oil. 4. When you press them if no batter oozes out, they are done. 5. Remove fritters from pan and place on paper towel. 6. Sprinkle with white sugar and eat warm.",
        "like_count": 0,
        "user_id": 2
    },
    {
        "title": "Vege Dip",
        "ingredients": "1 pkg (3 oz.) cream cheese, ½ cup mayonnaise, 3 tbsp catsup",
        "method": "Stir to mix. Serve with fresh sliced carrots, chunks of lettuce, cherry tomatoes, sliced zucchini, and/or other fresh vegetables, as desired.",
        "like_count": 0,
        "user_id": 2
    },
    {
        "title": "Great Brunch Casserole",
        "ingredients": "1 lb. pork sausage (brown and drain), 4 slices bread, cubed (about 2 cups), 1 ½ -2 cups shredded cheddar cheese, 6 eggs, ½ tbsp dry mustard, salt and pepper, 2 cups milk",
        "method": "Grease 9 x 13 baking dish. Make alternating layers of bread, sausage, and cheese. Mix eggs, milk and seasoning and pour over casserole. Bake at 325 degrees for 45 minutes or until knife inserted comes out clean.",
        "like_count": 0,
        "user_id": 2
    },
    {
        "title": "Champagne Punch",
        "ingredients": "2 bottles of champagne, 2 bottles of tonic water or similar, 1 bottle of white wine, frozen strawberries, ice, orange slices and kiwi slices (optional)",
        "method": "Combine ingredient in large punch bowl.",
        "like_count": 0,
        "user_id": 2
    },
    {
        "title": "Company Chicken",
        "ingredients": "1 cup rice, 1 package onion soup, ½ cup wine (sherry), 1 can mushroom soup, 1 ½ cup water, chicken",
        "method": "Mix together on bottom of greased pan (11 x 14). Place chicken parts on top. Bake at 375 degrees covered about 1 hour 15 minutes. Uncover for last 15 minutes. Stir rice under chicken once or twice during baking.",
        "like_count": 0,
        "user_id": 2
    },
    {
        "title": "Quiche Lorraine",
        "ingredients": "½ c. grated swiss cheese, ¼ c. grated parmesan cheese, ¼ c. grated cheddar cheese, 1 unbaked pie shell, 4 strips of bacon, cooked crisp and crumbled, 4 eggs slightly beaten, 1 c. milk, 1 c. heavy cream, ½ teas. salt, ¼ teas. pepper, some grains of nutmeg (optional - to add with bacon: 2 tbsp. chopped, sauteed zucchini, white onion mushrooms, green peppers and olives)",
        "method": "Sprinkle cheeses in unbaked pie shell. Add bacon. Combine eggs, milk, cream, salt, pepper, nutmeg. Mix well and pour into pie shell. Bake 400 degrees for about 40 minutes or until well set.",
        "like_count": 0,
        "user_id": 2
    },
    {
        "title": "Mandarin Orange / Chicken",
        "ingredients": "2 Chicken breasts, 1 C. chopped celery, 1 green pepper, sliced, 1 T. soy sauce, 1.2 tsp. ginger, 2 T. prepared mustard, ¼ C. honey, small can of mandarin oranges, drained. Optional: sliced almonds.",
        "method": "Cut up chicken and cook in 2 T. oil, add and sautee chopped/sliced celery and green pepper. Mix soy sauce, ginger, mustard, and honey into a sauce. Add mandarin oranges to sauce. Mix the sauce with the chicken and vegetables. Heat and serve over rice. Optional: add almonds.",
        "like_count": 0,
        "user_id": 2
    },
    {
        "title": "Grandma's Scalloped Potatoes",
        "ingredients": "Potatoes, flour, salt, milk, butter. Optional: onions, bread crumbs, paprika, cheese.",
        "method": "Evenly, thinly slice potatoes and lay them in greased baking dish. Sprinkle on flour and salt. Mix flour with potatoes - swish around to mix. Pour on milk (not quite cover), stir, dot with butter. Bake 350 degrees. 1 hour approx.",
        "like_count": 0,
        "user_id": 2
    }
    
]
